FKDD_COPY_DIFF_3_2026-02-14/Documents/ДатыЗапретаРедактированияНачислений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ДатыЗапретаРедактированияНачислений</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ДатыЗапретаРедактирования</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеКомпании</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторПоследнегоИзменения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПоследнегоИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнешнийОбъект</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДатыЗапрета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Месяц</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗапретРедактированияРасчета</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗапретРедактированияКорректировок</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-14/Documents/ДатыЗапретаРедактированияНачислений/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая() Тогда
		
		Объект.Автор = ПараметрыСеанса.Пользователь;
		Объект.Период = НачалоМесяца(ТекущаяДата());
		Объект.ПодразделениеКомпании = Справочники.ПодразделенияКомпании.ОсновноеПодразделение;
		Объект.Организация = Справочники.Организации.ОсновнаяОрганизация;
		
		Объект.ДатыЗапрета.Очистить();
		
		Для Сч=1 по 12 Цикл
			
			Нов = Объект.ДатыЗапрета.Добавить();
			Нов.ЗапретРедактированияРасчета="";
			Нов.ЗапретРедактированияКорректировок="";
			Нов.Месяц=ДобавитьМесяц(Объект.Период,Сч-1);
			
		КонецЦикла;

	КонецЕсли;	
	
	ДатаПланирования = Мотивация.ДатаКакМесяцПредставление(Объект.Период);

КонецПроцедуры

&НаКлиенте
Процедура ПериодНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если Объект.Период<Дата("01.01.2000 00:00:00") Тогда
		НачГод=Год(ТекущаяДата())-3;
		КонГод=Год(ТекущаяДата())+3;
	Иначе
		НачГод=Год(Объект.Период)-3;
		КонГод=Год(Объект.Период)+3;
	КонецЕсли;
	
	СпГодов=Новый СписокЗначений;
	Для Сч=НачГод по КонГод Цикл
		СпГодов.Добавить(Формат(Сч,"ЧЦ=4; ЧРД=; ЧРГ=; ЧГ="));
	КонецЦикла;
	
	Эл=ВыбратьИзМеню(СпГодов,Элемент);
	
	Если Не ПустаяСтрока(Эл) Тогда
		ДатаПланирования=Эл.Значение;
		Объект.Период=Дата("01.01."+ДатаПланирования+" 00:00:00");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПериодРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	Если Направление>0 Тогда
		Объект.Период=ДобавитьМесяц(Объект.Период,12);
	Иначе
		Объект.Период=ДобавитьМесяц(Объект.Период,-12);
	КонецЕсли;
	
	ДатаПланирования=Формат(Год(Объект.Период),"ЧЦ=4; ЧРД=; ЧРГ=; ЧГ=");

КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаполнитьПустыми(Команда)
	
	Объект.ДатыЗапрета.Очистить();
	
	Для Сч=1 по 12 Цикл
		
		Нов = Объект.ДатыЗапрета.Добавить();
		Нов.ЗапретРедактированияРасчета="";
		Нов.ЗапретРедактированияКорректировок="";
		Нов.Месяц=ДобавитьМесяц(Объект.Период,Сч-1);
		Нов.МесяцСтрока=Мотивация.ДатаКакМесяцПредставление(Нов.Месяц);
		
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ДатыЗапретаПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если Объект.ДатыЗапрета.Количество()=12 ТОгда
		Отказ=истина;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ДатыЗапретаПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	ТекСтр=Элементы.ДатыЗапрета.ТекущиеДанные;
	
	Если НоваяСтрока Тогда
		
		ТекСтр.Месяц=ДобавитьМесяц(Объект.Период,ТекСтр.НомерСтроки-1);
		ТекСтр.МесяцСтрока=Мотивация.ДатаКакМесяцПредставление(ТекСтр.Месяц);
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ДатыЗапретаМесяцПриИзменении(Элемент)
	
	ТекСтр=Элементы.ДатыЗапрета.ТекущиеДанные;
	
	Если НЕ ТекСтр = Неопределено Тогда
		
		ТекСтр.Месяц=ДобавитьМесяц(Объект.Период,ТекСтр.НомерСтроки-1);
		ТекСтр.МесяцСтрока=Мотивация.ДатаКакМесяцПредставление(ТекСтр.Месяц);
		
	КонецЕсли;

КонецПроцедуры
